print('Добро пожаловать в квиз по стартапам!')
print('Ответь на следующие вопросы:')

Score = 0


Questions = ["1. Как называется компания, которая создается для развития новой идеи или инновационного продукта?", "2. Как назвается человек или компания, который вкладывает деньги в бизнес с целью получения прибыли?", "3. Как называется капитал, который дают инвесторы на развитие стартапа?", "4. Как пишется минимально жизнеспособный продукт, который создается для тестирования идей и концепций?", "5. Какой план создают перед тем, как открывать стартап и занимать деньги?", "6. Как называются другие компании на рынке, которые предлагают аналогичные товары или услуги?", "7. Как называется разница между выручкой и затратами компании?"]

Answers = ["Стартап", "Инвестор", "Инвестиция", "MVP", "Бизнес-план", "Конкуренты", "Прибыль"]

print(Questions [0])

user_input = input('Введи ответ ')

print(user_input)

if user_input == Answers [0]:
  print('Правильно,молодец')
  Score += 1
else:
  print('Не правильно,попробуй еще раз')

print(Questions [1])

user_input = input('Введи ответ ')

print(user_input)

if user_input == Answers [1]:
  print('Правильно,молодец')
  Score += 1
else:
  print('Не правильно,попробуй еще раз')

print(Questions [2])

user_input = input('Введи ответ ')

print(user_input)

if user_input == Answers [2]:
  print('Правильно,молодец')
  Score += 1
else:
  print('Не правильно,попробуй еще раз')

print(Questions [3])

user_input = input('Введи ответ ')

print(user_input)

if user_input == Answers [3]:
  print('Правильно,молодец')
  Score += 1
else:
  print('Не правильно,попробуй еще раз')

print(Questions [4])

user_input = input('Введи ответ ')

print(user_input)

if user_input == Answers [4]:
  print('Правильно,молодец')
  Score += 1
else:
  print('Не правильно,попробуй еще раз')

print(Questions [5])

user_input = input('Введи ответ ')

print(user_input)

if user_input == Answers [5]:
  print('Правильно,молодец')
  Score += 1
else:
  print('Не правильно,попробуй еще раз')

print(Questions [6])

user_input = input('Введи ответ ')

print(user_input)

if user_input == Answers [6]:
  print('Правильно,молодец')
  Score += 1
else:
  print('Не правильно,попробуй еще раз')

print(Score)

if Score >= 5:
  print('Это отличный результат! Ты много знаешь о стартапах.')
elif Score >= 3:
  print('Неплохой результат! Как здорово, что тебе предстоит узнать ещё так много о стартапах.')
else:
  print('Видимо, ты только начинаешь свой путь к стартапам! Ты ещё много чего узнаешь о мире, где мы живём.')
  